|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
#Read data and describe it
import pandas as pd
df = pd.read_csv(r"c:\Users\srr07\Desktop\GitPython\dsc_weekday_2020_09_24\Assignments\Sreenivas\Assignment_TITANIC\titanic_Dataset.csv")
df.describe(include='all')

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308,295,1307,486,121.000000,745
unique,NaN,NaN,NaN,1307,2,NaN,NaN,NaN,929,263,186,3,27,NaN,369
top,NaN,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,$8.05,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,NaN,2,843,NaN,NaN,NaN,11,60,6,914,39,NaN,64
mean,654.000000,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,NaN,NaN,NaN,NaN,160.809917,NaN
std,378.020061,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,NaN,NaN,NaN,NaN,97.696922,NaN
min,0.000000,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,1.000000,NaN
25%,327.000000,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,72.000000,NaN
50%,654.000000,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,155.000000,NaN
75%,981.000000,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,NaN,NaN,NaN,NaN,256.000000,NaN
max,1308.000000,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,NaN,NaN,NaN,NaN,328.000000,NaN

In [2]:
#Find columns with missingdata
print(df.isna().any()) #by default axis for any is 0 i.e, column
print()
#print(df.isna().any(axis=1)) #To check the row

#Now Let's print the missing data in percentage:
a = df.isna().sum()  #shows the number of Na's present in a coloumn
b = df.shape[0] # shape is a touple with first argument showing number of rows.

print(a/b*100) #total percentage of NA's pesent.

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

Unnamed: 0     0.000000
pclass         0.000000
survived       0.000000
name           0.000000
gender         0.000000
age           20.091673
sibsp          0.000000
parch          0.000000
ticket         0.000000
fare           0.076394
cabin         77.463713
embarked       0.152788
boat          62.872422
body          90.756303
home.dest     43.086325
dtype: float64

In [3]:
#Print shape of dataset
print(df.shape) #describes a touple.. has rows and columns

(1309, 15)

In [4]:
#drop columns with more than 25% missing data
print(df.values)
print()
df = df.dropna(thresh=0.75*len(df.values), axis=1)
a = df.isna().sum()  #shows the number of Na's present in a coloumn
b = df.shape[0] # shape is a touple with first argument showing number of rows.

print(a/b*100) #total percentage of NA's pesent.

[[0 1 1 ... '2' nan 'St Louis, MO']
 [1 1 1 ... '11' nan 'Montreal, PQ / Chesterville, ON']
 [2 1 0 ... nan nan 'Montreal, PQ / Chesterville, ON']
 ...
 [1306 3 0 ... nan 304.0 nan]
 [1307 3 0 ... nan nan nan]
 [1308 3 0 ... nan nan nan]]

Unnamed: 0     0.000000
pclass         0.000000
survived       0.000000
name           0.000000
gender         0.000000
age           20.091673
sibsp          0.000000
parch          0.000000
ticket         0.000000
fare           0.076394
embarked       0.152788
dtype: float64

In [5]:
#drop columns having independent values(which do not affect the survival rate).
df.drop(columns=['Unnamed: 0'], inplace=True)
print(df.columns)

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'embarked'],
      dtype='object')

In [6]:
#check data types of all columns
print(df.dtypes)

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [7]:
#for ticket columns, find out rows which contain data because of which the type of ticket col is object not int/float
df.ticket[~df.ticket.str.isnumeric()]

9               PC 17609
10              PC 17757
11              PC 17757
12              PC 17477
15              PC 17318
              ...
1284    SOTON/OQ 3101316
1292       S.O./P.P. 751
1293            A/5 2466
1295    SOTON/OQ 3101317
1297          A/4. 34244
Name: ticket, Length: 352, dtype: object

In [8]:
#convert price to numeric
print(df.fare)
print()
df.fare = df.fare.str.replace(",", "")  #replace , with empty string
df["fare"] = df["fare"].str.replace("$", "") # replace $ with empty string. above one and this are same.
print()
df["fare"] = df["fare"].astype('float')
print(df.dtypes)

0       $211.34
1       $151.55
2       $151.55
3       $151.55
4       $151.55
          ...
1304     $14.45
1305     $14.45
1306      $7.23
1307      $7.23
1308      $7.88
Name: fare, Length: 1309, dtype: object


pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
embarked     object
dtype: object

In [9]:
#find columns still having missing/na values and also count of missing data
df.isna().sum()
#df.apply(lambda x: x.isna().any())

pclass        0
survived      0
name          0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [22]:
df.isnull().sum()

pclass      0
survived    0
name        0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64

In [10]:
#fill na with mean for fare and age column column
df.fillna({'fare': df.fare.mean(), 'age':df.age.mean()},inplace=True)
df.count()

pclass      1309
survived    1309
name        1309
gender      1309
age         1309
sibsp       1309
parch       1309
ticket      1309
fare        1309
embarked    1307
dtype: int64

In [11]:
#drop na values for embarked column.
df.dropna(inplace=True)
df.count()

pclass      1307
survived    1307
name        1307
gender      1307
age         1307
sibsp       1307
parch       1307
ticket      1307
fare        1307
embarked    1307
dtype: int64

In [12]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered.csv')

In [13]:
#for surviced column replace 0 with D and 1 with A
df.survived = df.survived.replace(0, "D")
df.survived = df.survived.replace(1, "A")
print()
df["survived"] = df["survived"].astype('string')
print(df.dtypes)
print(df.survived)

pclass        int64
survived     string
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
embarked     object
dtype: object
0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1307, dtype: string

In [14]:
#find the frequency of different values in survived column
df.survived.value_counts()

D    809
A    498
Name: survived, dtype: Int64

In [15]:
#group by gender and survived and see the counts in each category
grp = df.groupby(['survived','gender'])
grp.size()

survived  gender
A         female    337
          male      161
D         female    127
          male      682
dtype: int64

In [16]:
#find different pclass and no of people in each class
grp = df.groupby('pclass')
grp.embarked.count() #consider embarked..as they are on the board...

pclass
1    321
2    277
3    709
Name: embarked, dtype: int64

In [17]:
#find max age male and female who survived
grp = df.groupby(['survived','gender'])
grp.age.max()

survived  gender
A         female    76.0
          male      80.0
D         female    63.0
          male      74.0
Name: age, dtype: float64

In [18]:
#find top 5 people with highest values of age. Count no of male and females in the top 5
df1 = df.nlargest(5,{'age'})
df1.age

14      80.0
61      76.0
1235    74.0
9       71.0
135     71.0
Name: age, dtype: float64

In [19]:
grp = df1.groupby("gender")
grp.age.count()

gender
female    1
male      4
Name: age, dtype: int64

In [20]:
#get average age by gender
grp = df.groupby("gender")
grp.age.mean()

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [21]:
#get average age by people survived vs not-survived
grp = df.groupby("survived")
grp.age.mean()

survived
A    28.974711
D    30.389368
Name: age, dtype: float64